In [2]:
#Pandas Usage (used to create and sort with excel like tables)
import pandas as pd

In [ ]:
#read
df=pd.read_csv('file.csv')
df=pd.read_excel('file.xlsx')

#write
df.to_csv('file.csv')
df.to_excel('file.xlsx')

In [3]:
#create tables
data={'area':[1,2,3,4],'price':[2,3,4,5]}
df=pd.DataFrame(data)
df

   area  price
0     1      2
1     2      3
2     3      4
3     4      5

In [4]:
#access values
print(df.area)
print(df[['area']])

0    1
1    2
2    3
3    4
Name: area, dtype: int64
   area
0     1
1     2
2     3
3     4

In [5]:
#drop columns
df=df.drop(['area'],axis='columns')
df

   price
0      2
1      3
2      4
3      5

In [6]:
#Data Preprocessing 1 - Removing unwanted columns(unusable x factors)
data={'area':[1,2,3,4],'age':[1,2,3,4],'owner':['bradley','keven','sam','dickson'],'price':[2,3,4,5]}
df=pd.DataFrame(data)
df

   area  age    owner  price
0     1    1  bradley      2
1     2    2    keven      3
2     3    3      sam      4
3     4    4  dickson      5

In [7]:
#owner name will not affect house price, so drop it
df=df.drop(['owner'],axis='columns')
df

   area  age  price
0     1    1      2
1     2    2      3
2     3    3      4
3     4    4      5

In [3]:
#Data Preprocessing 2 - filling Nan values(empty slot)
import numpy as np
data={'area':[1,2,3,4],'age':[1,np.nan,3,np.nan],'owner':['bradley','keven','sam','dickson'],'price':[2,3,4,5]}
df=pd.DataFrame(data)
df

   area  age    owner  price
0     1  1.0  bradley      2
1     2  NaN    keven      3
2     3  3.0      sam      4
3     4  NaN  dickson      5

In [5]:
#recommendation: fill with mean values! (not affecting your model)
df.age=df.age.fillna(df.age.median())
df

   area  age    owner  price
0     1    1  bradley      2
1     2    2    keven      3
2     3    3      sam      4
3     4    4  dickson      5

In [11]:
#Data Preprocessing 3 - converting non-numerical factor to numbers
#machine can only deal with numbers
data={'name':['sam','dickson','daddy'],'mark':[12,33,99]}
df=pd.DataFrame(data)
df

      name  mark
0      sam    12
1  dickson    33
2    daddy    99

In [12]:
#converting to numerical labels with label encoder(could use ohe, etc)
from sklearn.preprocessing import LabelEncoder

label_encoder = LabelEncoder()

df.name=label_encoder.fit_transform(df.name)
df

   name  mark
0     2    12
1     1    33
2     0    99

In [14]:
#convert back to letter
df.name = label_encoder.inverse_transform(df.name)
df

      name  mark
0      sam    12
1  dickson    33
2    daddy    99

In [ ]:
#Data Preprocessing 4 - Natural Language Preprocessing
'''
steps:
1. lowercase every words
2. tokenise sentence
3. remove stop words
4. stemming/lemmatizing
'''

In [ ]:
#Sklearn - all machine algorithms
#common algo used:
#linear regression (straight forward x-y relationship)
#logistic regression (only nid to predict true or false)
#Naives Bayes Classifier (probability, mostly used of language based ai)
#K Means Clustering
#random forest
from sklearn import LinearRegression #-> change to any algorithm u wan
model=LinearRegression()
model.fit(x_factors,y_results)
model.predict(x_test) 
#->return a list of y_predicted results

In [ ]:
Artificial Neural Network
Convolutional NN
Recurrent NN

input layers=sensory neurons<-factors from the environment(temperature)
hidden layers=process and learn from the factors
output layers=motor neuron/prediction

input neurons?
how many layers of hidden neurons
what output neurons going to output?